data/2023_08_24/read_write_split_disable_with_read_pct_20_time_07_48_19/pod/test-mysql-run-20-80-4-time-2023-08-24-07-48/mysql_qps_latency.txt
run sysbench
check mysql database exists
mysql host 172.16.134.200 connect success!
database mydb exists
/usr/bin/sysbench
cd ./sysbench/src/lua;sysbench --db-driver=mysql --mysql-host=172.16.134.200 --mysql-port=3306 --mysql-user=root --mysql-password=sf2gxx9r --mysql-db=mydb --table_size=2000000 --tables=50 --time=100 --threads=4 --events=0 --percentile=99 --read-percent=20 --write-percent=80 --skip_trx=on --mysql-ignore-errors=1062 --db-ps-mode=disable --report-interval=1 oltp_read_write_pct run
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 4 tps: 21.97 qps: 2408.54 (r/w/o: 505.27/1903.27/0.00) lat (ms,99%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 4 tps: 22.01 qps: 2130.36 (r/w/o: 454.29/1676.07/0.00) lat (ms,99%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 4 tps: 16.00 qps: 1718.99 (r/w/o: 320.00/1398.99/0.00) lat (ms,99%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 4 tps: 16.00 qps: 1627.01 (r/w/o: 320.00/1307.00/0.00) lat (ms,99%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 4 tps: 18.00 qps: 1749.00 (r/w/o: 360.00/1389.00/0.00) lat (ms,99%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 4 tps: 18.00 qps: 1743.00 (r/w/o: 360.00/1383.00/0.00) lat (ms,99%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 4 tps: 16.00 qps: 1618.01 (r/w/o: 320.00/1298.00/0.00) lat (ms,99%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 4 tps: 20.00 qps: 1898.99 (r/w/o: 385.00/1513.99/0.00) lat (ms,99%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 4 tps: 20.00 qps: 2108.00 (r/w/o: 415.00/1693.00/0.00) lat (ms,99%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 21.00 qps: 2184.00 (r/w/o: 420.00/1764.00/0.00) lat (ms,99%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 4 tps: 23.00 qps: 2220.00 (r/w/o: 460.00/1760.00/0.00) lat (ms,99%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 4 tps: 20.00 qps: 2075.99 (r/w/o: 400.00/1675.99/0.00) lat (ms,99%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 4 tps: 18.00 qps: 1749.01 (r/w/o: 351.00/1398.01/0.00) lat (ms,99%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 4 tps: 18.00 qps: 1842.01 (r/w/o: 369.00/1473.01/0.00) lat (ms,99%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 19.00 qps: 1860.00 (r/w/o: 380.00/1480.00/0.00) lat (ms,99%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 4 tps: 18.00 qps: 1745.00 (r/w/o: 342.00/1403.00/0.00) lat (ms,99%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 4 tps: 16.00 qps: 1648.99 (r/w/o: 338.00/1310.99/0.00) lat (ms,99%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 4 tps: 16.00 qps: 1623.00 (r/w/o: 320.00/1303.00/0.00) lat (ms,99%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 4 tps: 16.00 qps: 1590.00 (r/w/o: 320.00/1270.00/0.00) lat (ms,99%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 16.00 qps: 1610.00 (r/w/o: 320.00/1290.00/0.00) lat (ms,99%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 4 tps: 15.00 qps: 1514.00 (r/w/o: 291.00/1223.00/0.00) lat (ms,99%): 331.91 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 4 tps: 18.00 qps: 1710.00 (r/w/o: 367.00/1343.00/0.00) lat (ms,99%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 4 tps: 13.00 qps: 1423.00 (r/w/o: 262.00/1161.00/0.00) lat (ms,99%): 344.08 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 4 tps: 16.00 qps: 1610.00 (r/w/o: 320.00/1290.00/0.00) lat (ms,99%): 320.17 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 20.00 qps: 1961.00 (r/w/o: 400.00/1561.00/0.00) lat (ms,99%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 4 tps: 20.00 qps: 1966.01 (r/w/o: 400.00/1566.01/0.00) lat (ms,99%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 4 tps: 20.00 qps: 2054.99 (r/w/o: 400.00/1654.99/0.00) lat (ms,99%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 4 tps: 21.00 qps: 2094.00 (r/w/o: 420.00/1674.00/0.00) lat (ms,99%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 4 tps: 20.00 qps: 1920.99 (r/w/o: 392.00/1528.99/0.00) lat (ms,99%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 19.00 qps: 1916.01 (r/w/o: 388.00/1528.01/0.00) lat (ms,99%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 4 tps: 21.00 qps: 2047.99 (r/w/o: 411.00/1636.99/0.00) lat (ms,99%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 4 tps: 20.00 qps: 2048.01 (r/w/o: 409.00/1639.00/0.00) lat (ms,99%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 4 tps: 20.00 qps: 2030.99 (r/w/o: 400.00/1630.99/0.00) lat (ms,99%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 4 tps: 20.00 qps: 1962.00 (r/w/o: 400.00/1562.00/0.00) lat (ms,99%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 16.00 qps: 1704.00 (r/w/o: 320.00/1384.00/0.00) lat (ms,99%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 4 tps: 19.00 qps: 1692.00 (r/w/o: 360.00/1332.00/0.00) lat (ms,99%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 4 tps: 16.00 qps: 1637.00 (r/w/o: 340.00/1297.00/0.00) lat (ms,99%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 4 tps: 15.00 qps: 1582.00 (r/w/o: 287.00/1295.00/0.00) lat (ms,99%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 4 tps: 17.00 qps: 1657.01 (r/w/o: 353.00/1304.00/0.00) lat (ms,99%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 14.00 qps: 1490.00 (r/w/o: 280.00/1210.00/0.00) lat (ms,99%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 4 tps: 19.00 qps: 1938.99 (r/w/o: 380.00/1559.00/0.00) lat (ms,99%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 4 tps: 20.00 qps: 1987.01 (r/w/o: 400.00/1587.01/0.00) lat (ms,99%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 4 tps: 21.00 qps: 2011.99 (r/w/o: 403.00/1609.00/0.00) lat (ms,99%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 4 tps: 21.00 qps: 2099.99 (r/w/o: 437.00/1662.99/0.00) lat (ms,99%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 20.00 qps: 1995.00 (r/w/o: 400.00/1595.00/0.00) lat (ms,99%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 4 tps: 16.00 qps: 1638.00 (r/w/o: 320.00/1318.00/0.00) lat (ms,99%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 4 tps: 18.00 qps: 1778.00 (r/w/o: 360.00/1418.00/0.00) lat (ms,99%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 4 tps: 18.00 qps: 1707.99 (r/w/o: 345.00/1362.99/0.00) lat (ms,99%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 4 tps: 16.00 qps: 1661.01 (r/w/o: 335.00/1326.01/0.00) lat (ms,99%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 15.00 qps: 1500.00 (r/w/o: 300.00/1200.00/0.00) lat (ms,99%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 4 tps: 15.00 qps: 1558.00 (r/w/o: 300.00/1258.00/0.00) lat (ms,99%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 4 tps: 19.00 qps: 1854.00 (r/w/o: 380.00/1474.00/0.00) lat (ms,99%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 4 tps: 18.00 qps: 1837.00 (r/w/o: 360.00/1477.00/0.00) lat (ms,99%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 4 tps: 20.00 qps: 1981.00 (r/w/o: 400.00/1581.00/0.00) lat (ms,99%): 231.53 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 20.00 qps: 2047.00 (r/w/o: 400.00/1647.00/0.00) lat (ms,99%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 4 tps: 20.00 qps: 1996.00 (r/w/o: 400.00/1596.00/0.00) lat (ms,99%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 4 tps: 18.00 qps: 1764.00 (r/w/o: 360.00/1404.00/0.00) lat (ms,99%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 4 tps: 16.00 qps: 1621.01 (r/w/o: 320.00/1301.00/0.00) lat (ms,99%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 4 tps: 16.00 qps: 1567.00 (r/w/o: 303.00/1264.00/0.00) lat (ms,99%): 331.91 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 14.00 qps: 1433.00 (r/w/o: 297.00/1136.00/0.00) lat (ms,99%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 4 tps: 16.00 qps: 1541.00 (r/w/o: 320.00/1221.00/0.00) lat (ms,99%): 350.33 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 4 tps: 15.00 qps: 1498.99 (r/w/o: 300.00/1198.99/0.00) lat (ms,99%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 4 tps: 18.00 qps: 1783.01 (r/w/o: 360.00/1423.01/0.00) lat (ms,99%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 4 tps: 19.00 qps: 1953.00 (r/w/o: 380.00/1573.00/0.00) lat (ms,99%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 4 tps: 21.00 qps: 2090.01 (r/w/o: 420.00/1670.01/0.00) lat (ms,99%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 4 tps: 20.00 qps: 2004.99 (r/w/o: 400.00/1604.99/0.00) lat (ms,99%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 4 tps: 20.00 qps: 2031.01 (r/w/o: 400.00/1631.01/0.00) lat (ms,99%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 4 tps: 19.00 qps: 1815.99 (r/w/o: 373.00/1443.00/0.00) lat (ms,99%): 253.35 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 4 tps: 18.00 qps: 1811.01 (r/w/o: 353.00/1458.01/0.00) lat (ms,99%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 17.00 qps: 1751.00 (r/w/o: 348.00/1403.00/0.00) lat (ms,99%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 4 tps: 18.00 qps: 1733.99 (r/w/o: 360.00/1374.00/0.00) lat (ms,99%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 4 tps: 14.00 qps: 1469.00 (r/w/o: 286.00/1183.00/0.00) lat (ms,99%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 4 tps: 15.00 qps: 1520.00 (r/w/o: 300.00/1220.00/0.00) lat (ms,99%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 4 tps: 20.00 qps: 1899.99 (r/w/o: 383.00/1516.99/0.00) lat (ms,99%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 4 tps: 18.00 qps: 1950.00 (r/w/o: 377.00/1573.00/0.00) lat (ms,99%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 4 tps: 22.00 qps: 2079.99 (r/w/o: 440.00/1639.99/0.00) lat (ms,99%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 4 tps: 20.00 qps: 2015.00 (r/w/o: 400.00/1615.00/0.00) lat (ms,99%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 4 tps: 20.00 qps: 2006.00 (r/w/o: 400.00/1606.00/0.00) lat (ms,99%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 4 tps: 17.00 qps: 1776.01 (r/w/o: 340.00/1436.01/0.00) lat (ms,99%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 21.00 qps: 2038.00 (r/w/o: 404.00/1634.00/0.00) lat (ms,99%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 4 tps: 19.00 qps: 1995.00 (r/w/o: 396.00/1599.00/0.00) lat (ms,99%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 4 tps: 22.00 qps: 2083.00 (r/w/o: 440.00/1643.00/0.00) lat (ms,99%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 4 tps: 20.00 qps: 1974.00 (r/w/o: 388.00/1586.00/0.00) lat (ms,99%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 4 tps: 18.00 qps: 1924.00 (r/w/o: 372.00/1552.00/0.00) lat (ms,99%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 4 tps: 16.00 qps: 1606.00 (r/w/o: 320.00/1286.00/0.00) lat (ms,99%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 4 tps: 19.00 qps: 1790.00 (r/w/o: 380.00/1410.00/0.00) lat (ms,99%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 4 tps: 17.00 qps: 1819.00 (r/w/o: 340.00/1479.00/0.00) lat (ms,99%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 4 tps: 19.00 qps: 1759.00 (r/w/o: 380.00/1379.00/0.00) lat (ms,99%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 4 tps: 15.00 qps: 1543.00 (r/w/o: 300.00/1243.00/0.00) lat (ms,99%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 16.00 qps: 1630.00 (r/w/o: 320.00/1310.00/0.00) lat (ms,99%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 4 tps: 18.00 qps: 1833.99 (r/w/o: 360.00/1473.99/0.00) lat (ms,99%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 4 tps: 20.00 qps: 1943.01 (r/w/o: 400.00/1543.01/0.00) lat (ms,99%): 231.53 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 4 tps: 20.00 qps: 2004.99 (r/w/o: 400.00/1604.99/0.00) lat (ms,99%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 4 tps: 20.00 qps: 2033.01 (r/w/o: 400.00/1633.00/0.00) lat (ms,99%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 4 tps: 18.00 qps: 1740.01 (r/w/o: 348.00/1392.00/0.00) lat (ms,99%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 4 tps: 16.00 qps: 1634.99 (r/w/o: 332.00/1302.99/0.00) lat (ms,99%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 4 tps: 16.00 qps: 1637.00 (r/w/o: 320.00/1317.00/0.00) lat (ms,99%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 4 tps: 17.00 qps: 1634.00 (r/w/o: 340.00/1294.00/0.00) lat (ms,99%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 4 tps: 16.00 qps: 1654.99 (r/w/o: 320.00/1335.00/0.00) lat (ms,99%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 17.00 qps: 1651.00 (r/w/o: 340.00/1311.00/0.00) lat (ms,99%): 308.84 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            36400
        write:                           145600
        other:                           0
        total:                           182000
    transactions:                        1820   (18.17 per sec.)
    queries:                             182000 (1817.28 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.1484s
    total number of events:              1820

Latency (ms):
         min:                                  148.53
         avg:                                  220.01
         max:                                  349.62
         99th percentile:                      308.84
         sum:                               400412.13

Threads fairness:
    events (avg/stddev):           455.0000/0.71
    execution time (avg/stddev):   100.1030/0.04